module {
  func.func @torch_jit(%arg0: !torch.vtensor<[1,3,224,224],f32>) -> !torch.vtensor<[1,1000],f32> attributes {torch.onnx_meta.ir_version = 8 : si64, torch.onnx_meta.opset_version = 17 : si64, torch.onnx_meta.producer_name = "pytorch", torch.onnx_meta.producer_version = "1.13.1"} {
    %float1.525880e-05 = torch.constant.float 1.52587890625E-5
    %float3.051760e-05 = torch.constant.float 3.0517578125E-5
    %float6.103520e-05 = torch.constant.float 6.103515625E-5
    %float1.220700e-04 = torch.constant.float 1.220703125E-4
    %int14 = torch.constant.int 14
    %float2.441410e-04 = torch.constant.float 2.44140625E-4
    %float4.882810e-04 = torch.constant.float 4.8828125E-4
    %float1.953130e-03 = torch.constant.float 0.001953125
    %float1.562500e-02 = torch.constant.float 1.562500e-02
    %float3.125000e-02 = torch.constant.float 3.125000e-02
    %float7.812500e-03 = torch.constant.float 7.812500e-03
    %float3.906250e-03 = torch.constant.float 3.906250e-03
    %0 = torch.vtensor.literal(dense<1.00488281> : tensor<f32>) : !torch.vtensor<[],f32>
    %int7 = torch.constant.int 7
    %false = torch.constant.bool false
    %int0 = torch.constant.int 0
    %int2 = torch.constant.int 2
    %int1 = torch.constant.int 1
    %int3 = torch.constant.int 3
    %1 = torch.vtensor.literal(dense_resource<__elided__> : tensor<64x3x7x7xf32>) : !torch.vtensor<[64,3,7,7],f32>
    %2 = torch.vtensor.literal(dense_resource<__elided__> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %3 = torch.vtensor.literal(dense_resource<__elided__> : tensor<64x64x1x1xf32>) : !torch.vtensor<[64,64,1,1],f32>
    %4 = torch.vtensor.literal(dense_resource<__elided__> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %5 = torch.vtensor.literal(dense_resource<__elided__> : tensor<64x64x3x3xf32>) : !torch.vtensor<[64,64,3,3],f32>
    %6 = torch.vtensor.literal(dense_resource<__elided__> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %7 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256x64x1x1xf32>) : !torch.vtensor<[256,64,1,1],f32>
    %8 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256xf32>) : !torch.vtensor<[256],f32>
    %9 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256x64x1x1xf32>) : !torch.vtensor<[256,64,1,1],f32>
    %10 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256xf32>) : !torch.vtensor<[256],f32>
    %11 = torch.vtensor.literal(dense_resource<__elided__> : tensor<64x256x1x1xf32>) : !torch.vtensor<[64,256,1,1],f32>
    %12 = torch.vtensor.literal(dense_resource<__elided__> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %13 = torch.vtensor.literal(dense_resource<__elided__> : tensor<64x64x3x3xf32>) : !torch.vtensor<[64,64,3,3],f32>
    %14 = torch.vtensor.literal(dense_resource<__elided__> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %15 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256x64x1x1xf32>) : !torch.vtensor<[256,64,1,1],f32>
    %16 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256xf32>) : !torch.vtensor<[256],f32>
    %17 = torch.vtensor.literal(dense_resource<__elided__> : tensor<64x256x1x1xf32>) : !torch.vtensor<[64,256,1,1],f32>
    %18 = torch.vtensor.literal(dense_resource<__elided__> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %19 = torch.vtensor.literal(dense_resource<__elided__> : tensor<64x64x3x3xf32>) : !torch.vtensor<[64,64,3,3],f32>
    %20 = torch.vtensor.literal(dense_resource<__elided__> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %21 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256x64x1x1xf32>) : !torch.vtensor<[256,64,1,1],f32>
    %22 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256xf32>) : !torch.vtensor<[256],f32>
    %23 = torch.vtensor.literal(dense_resource<__elided__> : tensor<128x256x1x1xf32>) : !torch.vtensor<[128,256,1,1],f32>
    %24 = torch.vtensor.literal(dense_resource<__elided__> : tensor<128xf32>) : !torch.vtensor<[128],f32>
    %25 = torch.vtensor.literal(dense_resource<__elided__> : tensor<128x128x3x3xf32>) : !torch.vtensor<[128,128,3,3],f32>
    %26 = torch.vtensor.literal(dense_resource<__elided__> : tensor<128xf32>) : !torch.vtensor<[128],f32>
    %27 = torch.vtensor.literal(dense_resource<__elided__> : tensor<512x128x1x1xf32>) : !torch.vtensor<[512,128,1,1],f32>
    %28 = torch.vtensor.literal(dense_resource<__elided__> : tensor<512xf32>) : !torch.vtensor<[512],f32>
    %29 = torch.vtensor.literal(dense_resource<__elided__> : tensor<512x256x1x1xf32>) : !torch.vtensor<[512,256,1,1],f32>
    %30 = torch.vtensor.literal(dense_resource<__elided__> : tensor<512xf32>) : !torch.vtensor<[512],f32>
    %31 = torch.vtensor.literal(dense_resource<__elided__> : tensor<128x512x1x1xf32>) : !torch.vtensor<[128,512,1,1],f32>
    %32 = torch.vtensor.literal(dense_resource<__elided__> : tensor<128xf32>) : !torch.vtensor<[128],f32>
    %33 = torch.vtensor.literal(dense_resource<__elided__> : tensor<128x128x3x3xf32>) : !torch.vtensor<[128,128,3,3],f32>
    %34 = torch.vtensor.literal(dense_resource<__elided__> : tensor<128xf32>) : !torch.vtensor<[128],f32>
    %35 = torch.vtensor.literal(dense_resource<__elided__> : tensor<512x128x1x1xf32>) : !torch.vtensor<[512,128,1,1],f32>
    %36 = torch.vtensor.literal(dense_resource<__elided__> : tensor<512xf32>) : !torch.vtensor<[512],f32>
    %37 = torch.vtensor.literal(dense_resource<__elided__> : tensor<128x512x1x1xf32>) : !torch.vtensor<[128,512,1,1],f32>
    %38 = torch.vtensor.literal(dense_resource<__elided__> : tensor<128xf32>) : !torch.vtensor<[128],f32>
    %39 = torch.vtensor.literal(dense_resource<__elided__> : tensor<128x128x3x3xf32>) : !torch.vtensor<[128,128,3,3],f32>
    %40 = torch.vtensor.literal(dense_resource<__elided__> : tensor<128xf32>) : !torch.vtensor<[128],f32>
    %41 = torch.vtensor.literal(dense_resource<__elided__> : tensor<512x128x1x1xf32>) : !torch.vtensor<[512,128,1,1],f32>
    %42 = torch.vtensor.literal(dense_resource<__elided__> : tensor<512xf32>) : !torch.vtensor<[512],f32>
    %43 = torch.vtensor.literal(dense_resource<__elided__> : tensor<128x512x1x1xf32>) : !torch.vtensor<[128,512,1,1],f32>
    %44 = torch.vtensor.literal(dense_resource<__elided__> : tensor<128xf32>) : !torch.vtensor<[128],f32>
    %45 = torch.vtensor.literal(dense_resource<__elided__> : tensor<128x128x3x3xf32>) : !torch.vtensor<[128,128,3,3],f32>
    %46 = torch.vtensor.literal(dense_resource<__elided__> : tensor<128xf32>) : !torch.vtensor<[128],f32>
    %47 = torch.vtensor.literal(dense_resource<__elided__> : tensor<512x128x1x1xf32>) : !torch.vtensor<[512,128,1,1],f32>
    %48 = torch.vtensor.literal(dense_resource<__elided__> : tensor<512xf32>) : !torch.vtensor<[512],f32>
    %49 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256x512x1x1xf32>) : !torch.vtensor<[256,512,1,1],f32>
    %50 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256xf32>) : !torch.vtensor<[256],f32>
    %51 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256x256x3x3xf32>) : !torch.vtensor<[256,256,3,3],f32>
    %52 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256xf32>) : !torch.vtensor<[256],f32>
    %53 = torch.vtensor.literal(dense_resource<__elided__> : tensor<1024x256x1x1xf32>) : !torch.vtensor<[1024,256,1,1],f32>
    %54 = torch.vtensor.literal(dense_resource<__elided__> : tensor<1024xf32>) : !torch.vtensor<[1024],f32>
    %55 = torch.vtensor.literal(dense_resource<__elided__> : tensor<1024x512x1x1xf32>) : !torch.vtensor<[1024,512,1,1],f32>
    %56 = torch.vtensor.literal(dense_resource<__elided__> : tensor<1024xf32>) : !torch.vtensor<[1024],f32>
    %57 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256x1024x1x1xf32>) : !torch.vtensor<[256,1024,1,1],f32>
    %58 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256xf32>) : !torch.vtensor<[256],f32>
    %59 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256x256x3x3xf32>) : !torch.vtensor<[256,256,3,3],f32>
    %60 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256xf32>) : !torch.vtensor<[256],f32>
    %61 = torch.vtensor.literal(dense_resource<__elided__> : tensor<1024x256x1x1xf32>) : !torch.vtensor<[1024,256,1,1],f32>
    %62 = torch.vtensor.literal(dense_resource<__elided__> : tensor<1024xf32>) : !torch.vtensor<[1024],f32>
    %63 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256x1024x1x1xf32>) : !torch.vtensor<[256,1024,1,1],f32>
    %64 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256xf32>) : !torch.vtensor<[256],f32>
    %65 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256x256x3x3xf32>) : !torch.vtensor<[256,256,3,3],f32>
    %66 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256xf32>) : !torch.vtensor<[256],f32>
    %67 = torch.vtensor.literal(dense_resource<__elided__> : tensor<1024x256x1x1xf32>) : !torch.vtensor<[1024,256,1,1],f32>
    %68 = torch.vtensor.literal(dense_resource<__elided__> : tensor<1024xf32>) : !torch.vtensor<[1024],f32>
    %69 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256x1024x1x1xf32>) : !torch.vtensor<[256,1024,1,1],f32>
    %70 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256xf32>) : !torch.vtensor<[256],f32>
    %71 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256x256x3x3xf32>) : !torch.vtensor<[256,256,3,3],f32>
    %72 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256xf32>) : !torch.vtensor<[256],f32>
    %73 = torch.vtensor.literal(dense_resource<__elided__> : tensor<1024x256x1x1xf32>) : !torch.vtensor<[1024,256,1,1],f32>
    %74 = torch.vtensor.literal(dense_resource<__elided__> : tensor<1024xf32>) : !torch.vtensor<[1024],f32>
    %75 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256x1024x1x1xf32>) : !torch.vtensor<[256,1024,1,1],f32>
    %76 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256xf32>) : !torch.vtensor<[256],f32>
    %77 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256x256x3x3xf32>) : !torch.vtensor<[256,256,3,3],f32>
    %78 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256xf32>) : !torch.vtensor<[256],f32>
    %79 = torch.vtensor.literal(dense_resource<__elided__> : tensor<1024x256x1x1xf32>) : !torch.vtensor<[1024,256,1,1],f32>
    %80 = torch.vtensor.literal(dense_resource<__elided__> : tensor<1024xf32>) : !torch.vtensor<[1024],f32>
    %81 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256x1024x1x1xf32>) : !torch.vtensor<[256,1024,1,1],f32>
    %82 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256xf32>) : !torch.vtensor<[256],f32>
    %83 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256x256x3x3xf32>) : !torch.vtensor<[256,256,3,3],f32>
    %84 = torch.vtensor.literal(dense_resource<__elided__> : tensor<256xf32>) : !torch.vtensor<[256],f32>
    %85 = torch.vtensor.literal(dense_resource<__elided__> : tensor<1024x256x1x1xf32>) : !torch.vtensor<[1024,256,1,1],f32>
    %86 = torch.vtensor.literal(dense_resource<__elided__> : tensor<1024xf32>) : !torch.vtensor<[1024],f32>
    %87 = torch.vtensor.literal(dense_resource<__elided__> : tensor<512x1024x1x1xf32>) : !torch.vtensor<[512,1024,1,1],f32>
    %88 = torch.vtensor.literal(dense_resource<__elided__> : tensor<512xf32>) : !torch.vtensor<[512],f32>
    %89 = torch.vtensor.literal(dense_resource<__elided__> : tensor<512x512x3x3xf32>) : !torch.vtensor<[512,512,3,3],f32>
    %90 = torch.vtensor.literal(dense_resource<__elided__> : tensor<512xf32>) : !torch.vtensor<[512],f32>
    %91 = torch.vtensor.literal(dense_resource<__elided__> : tensor<2048x512x1x1xf32>) : !torch.vtensor<[2048,512,1,1],f32>
    %92 = torch.vtensor.literal(dense_resource<__elided__> : tensor<2048xf32>) : !torch.vtensor<[2048],f32>
    %93 = torch.vtensor.literal(dense_resource<__elided__> : tensor<2048x1024x1x1xf32>) : !torch.vtensor<[2048,1024,1,1],f32>
    %94 = torch.vtensor.literal(dense_resource<__elided__> : tensor<2048xf32>) : !torch.vtensor<[2048],f32>
    %95 = torch.vtensor.literal(dense_resource<__elided__> : tensor<512x2048x1x1xf32>) : !torch.vtensor<[512,2048,1,1],f32>
    %96 = torch.vtensor.literal(dense_resource<__elided__> : tensor<512xf32>) : !torch.vtensor<[512],f32>
    %97 = torch.vtensor.literal(dense_resource<__elided__> : tensor<512x512x3x3xf32>) : !torch.vtensor<[512,512,3,3],f32>
    %98 = torch.vtensor.literal(dense_resource<__elided__> : tensor<512xf32>) : !torch.vtensor<[512],f32>
    %99 = torch.vtensor.literal(dense_resource<__elided__> : tensor<2048x512x1x1xf32>) : !torch.vtensor<[2048,512,1,1],f32>
    %100 = torch.vtensor.literal(dense_resource<__elided__> : tensor<2048xf32>) : !torch.vtensor<[2048],f32>
    %101 = torch.vtensor.literal(dense_resource<__elided__> : tensor<512x2048x1x1xf32>) : !torch.vtensor<[512,2048,1,1],f32>
    %102 = torch.vtensor.literal(dense_resource<__elided__> : tensor<512xf32>) : !torch.vtensor<[512],f32>
    %103 = torch.vtensor.literal(dense_resource<__elided__> : tensor<512x512x3x3xf32>) : !torch.vtensor<[512,512,3,3],f32>
    %104 = torch.vtensor.literal(dense_resource<__elided__> : tensor<512xf32>) : !torch.vtensor<[512],f32>
    %105 = torch.vtensor.literal(dense_resource<__elided__> : tensor<2048x512x1x1xf32>) : !torch.vtensor<[2048,512,1,1],f32>
    %106 = torch.vtensor.literal(dense_resource<__elided__> : tensor<2048xf32>) : !torch.vtensor<[2048],f32>
    %107 = torch.vtensor.literal(dense_resource<__elided__> : tensor<1000x2048xf32>) : !torch.vtensor<[1000,2048],f32>
    %108 = torch.vtensor.literal(dense_resource<__elided__> : tensor<1000xf32>) : !torch.vtensor<[1000],f32>
    %none = torch.constant.none
    %int12 = torch.constant.int 12
    %float6.250000e-02 = torch.constant.float 6.250000e-02
    %109 = torch.aten.quantize_per_tensor %arg0, %float6.250000e-02, %int0, %int12 : !torch.vtensor<[1,3,224,224],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[1,3,224,224],!torch.qint8>
    %110 = torch.aten.int_repr %109 : !torch.vtensor<[1,3,224,224],!torch.qint8> -> !torch.vtensor<[1,3,224,224],si8>
    %111 = torch.aten._make_per_tensor_quantized_tensor %110, %float6.250000e-02, %int0 : !torch.vtensor<[1,3,224,224],si8>, !torch.float, !torch.int -> !torch.vtensor<[1,3,224,224],!torch.qint8>
    %112 = torch.aten.quantize_per_tensor %1, %float3.906250e-03, %int0, %int12 : !torch.vtensor<[64,3,7,7],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[64,3,7,7],!torch.qint8>
    %113 = torch.aten.int_repr %112 : !torch.vtensor<[64,3,7,7],!torch.qint8> -> !torch.vtensor<[64,3,7,7],si8>
    %114 = torch.aten._make_per_tensor_quantized_tensor %113, %float3.906250e-03, %int0 : !torch.vtensor<[64,3,7,7],si8>, !torch.float, !torch.int -> !torch.vtensor<[64,3,7,7],!torch.qint8>
    %115 = torch.aten.quantize_per_tensor %2, %float7.812500e-03, %int0, %int12 : !torch.vtensor<[64],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[64],!torch.qint8>
    %116 = torch.aten.int_repr %115 : !torch.vtensor<[64],!torch.qint8> -> !torch.vtensor<[64],si8>
    %117 = torch.aten._make_per_tensor_quantized_tensor %116, %float7.812500e-03, %int0 : !torch.vtensor<[64],si8>, !torch.float, !torch.int -> !torch.vtensor<[64],!torch.qint8>
    %118 = torch.aten.dequantize.self %117 : !torch.vtensor<[64],!torch.qint8> -> !torch.vtensor<[64],f32>
    %119 = torch.prim.ListConstruct %int3, %int3 : (!torch.int, !torch.int) -> !torch.list<int>
    %120 = torch.prim.ListConstruct %int1, %int1 : (!torch.int, !torch.int) -> !torch.list<int>
    %121 = torch.prim.ListConstruct %int2, %int2 : (!torch.int, !torch.int) -> !torch.list<int>
    %122 = torch.prim.ListConstruct %int0, %int0 : (!torch.int, !torch.int) -> !torch.list<int>
    %123 = torch.aten.quantize_per_tensor %118, %float2.441410e-04, %int0, %int14 : !torch.vtensor<[64],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[64],!torch.qint32>
    %124 = torch.aten.int_repr %123 : !torch.vtensor<[64],!torch.qint32> -> !torch.vtensor<[64],si32>
    %125 = torch.aten.convolution %111, %114, %124, %121, %119, %120, %false, %122, %int1 : !torch.vtensor<[1,3,224,224],!torch.qint8>, !torch.vtensor<[64,3,7,7],!torch.qint8>, !torch.vtensor<[64],si32>, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.bool, !torch.list<int>, !torch.int -> !torch.vtensor<[1,64,112,112],si32>
    %126 = torch.aten._make_per_tensor_quantized_tensor %125, %float2.441410e-04, %int0 : !torch.vtensor<[1,64,112,112],si32>, !torch.float, !torch.int -> !torch.vtensor<[1,64,112,112],!torch.qint32>
    %127 = torch.aten.relu %126 : !torch.vtensor<[1,64,112,112],!torch.qint32> -> !torch.vtensor<[1,64,112,112],!torch.qint32>
    %128 = torch.aten.int_repr %127 : !torch.vtensor<[1,64,112,112],!torch.qint32> -> !torch.vtensor<[1,64,112,112],si32>
    %129 = torch.aten._make_per_tensor_quantized_tensor %128, %float2.441410e-04, %int0 : !torch.vtensor<[1,64,112,112],si32>, !torch.float, !torch.int -> !torch.vtensor<[1,64,112,112],!torch.qint32>
    %130 = torch.aten.dequantize.tensor %129 : !torch.vtensor<[1,64,112,112],!torch.qint32> -> !torch.vtensor<[1,64,112,112],f32>
    %131 = torch.aten.quantize_per_tensor %130, %float3.125000e-02, %int0, %int12 : !torch.vtensor<[1,64,112,112],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[1,64,112,112],!torch.qint8>
    %132 = torch.aten.int_repr %131 : !torch.vtensor<[1,64,112,112],!torch.qint8> -> !torch.vtensor<[1,64,112,112],si8>
    %133 = torch.aten._make_per_tensor_quantized_tensor %132, %float3.125000e-02, %int0 : !torch.vtensor<[1,64,112,112],si8>, !torch.float, !torch.int -> !torch.vtensor<[1,64,112,112],!torch.qint8>
    %134 = torch.aten.dequantize.self %133 : !torch.vtensor<[1,64,112,112],!torch.qint8> -> !torch.vtensor<[1,64,112,112],f32>
    %135 = torch.aten.max_pool2d %134, %119, %121, %120, %120, %false : !torch.vtensor<[1,64,112,112],f32>, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.bool -> !torch.vtensor<[1,64,56,56],f32>
    %136 = torch.aten.quantize_per_tensor %135, %float3.125000e-02, %int0, %int12 : !torch.vtensor<[1,64,56,56],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint8>
    %137 = torch.aten.int_repr %136 : !torch.vtensor<[1,64,56,56],!torch.qint8> -> !torch.vtensor<[1,64,56,56],si8>
    %138 = torch.aten._make_per_tensor_quantized_tensor %137, %float3.125000e-02, %int0 : !torch.vtensor<[1,64,56,56],si8>, !torch.float, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint8>
    %139 = torch.aten.quantize_per_tensor %3, %float3.906250e-03, %int0, %int12 : !torch.vtensor<[64,64,1,1],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[64,64,1,1],!torch.qint8>
    %140 = torch.aten.int_repr %139 : !torch.vtensor<[64,64,1,1],!torch.qint8> -> !torch.vtensor<[64,64,1,1],si8>
    %141 = torch.aten._make_per_tensor_quantized_tensor %140, %float3.906250e-03, %int0 : !torch.vtensor<[64,64,1,1],si8>, !torch.float, !torch.int -> !torch.vtensor<[64,64,1,1],!torch.qint8>
    %142 = torch.aten.quantize_per_tensor %4, %float7.812500e-03, %int0, %int12 : !torch.vtensor<[64],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[64],!torch.qint8>
    %143 = torch.aten.int_repr %142 : !torch.vtensor<[64],!torch.qint8> -> !torch.vtensor<[64],si8>
    %144 = torch.aten._make_per_tensor_quantized_tensor %143, %float7.812500e-03, %int0 : !torch.vtensor<[64],si8>, !torch.float, !torch.int -> !torch.vtensor<[64],!torch.qint8>
    %145 = torch.aten.dequantize.self %144 : !torch.vtensor<[64],!torch.qint8> -> !torch.vtensor<[64],f32>
    %146 = torch.aten.quantize_per_tensor %145, %float1.220700e-04, %int0, %int14 : !torch.vtensor<[64],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[64],!torch.qint32>
    %147 = torch.aten.int_repr %146 : !torch.vtensor<[64],!torch.qint32> -> !torch.vtensor<[64],si32>
    %148 = torch.aten.convolution %138, %141, %147, %120, %122, %120, %false, %122, %int1 : !torch.vtensor<[1,64,56,56],!torch.qint8>, !torch.vtensor<[64,64,1,1],!torch.qint8>, !torch.vtensor<[64],si32>, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.bool, !torch.list<int>, !torch.int -> !torch.vtensor<[1,64,56,56],si32>
    %149 = torch.aten._make_per_tensor_quantized_tensor %148, %float1.220700e-04, %int0 : !torch.vtensor<[1,64,56,56],si32>, !torch.float, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint32>
    %150 = torch.aten.relu %149 : !torch.vtensor<[1,64,56,56],!torch.qint32> -> !torch.vtensor<[1,64,56,56],!torch.qint32>
    %151 = torch.aten.int_repr %150 : !torch.vtensor<[1,64,56,56],!torch.qint32> -> !torch.vtensor<[1,64,56,56],si32>
    %152 = torch.aten._make_per_tensor_quantized_tensor %151, %float1.220700e-04, %int0 : !torch.vtensor<[1,64,56,56],si32>, !torch.float, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint32>
    %153 = torch.aten.dequantize.tensor %152 : !torch.vtensor<[1,64,56,56],!torch.qint32> -> !torch.vtensor<[1,64,56,56],f32>
    %154 = torch.aten.quantize_per_tensor %153, %float1.562500e-02, %int0, %int12 : !torch.vtensor<[1,64,56,56],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint8>
    %155 = torch.aten.int_repr %154 : !torch.vtensor<[1,64,56,56],!torch.qint8> -> !torch.vtensor<[1,64,56,56],si8>
    %156 = torch.aten._make_per_tensor_quantized_tensor %155, %float1.562500e-02, %int0 : !torch.vtensor<[1,64,56,56],si8>, !torch.float, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint8>
    %157 = torch.aten.quantize_per_tensor %5, %float3.906250e-03, %int0, %int12 : !torch.vtensor<[64,64,3,3],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[64,64,3,3],!torch.qint8>
    %158 = torch.aten.int_repr %157 : !torch.vtensor<[64,64,3,3],!torch.qint8> -> !torch.vtensor<[64,64,3,3],si8>
    %159 = torch.aten._make_per_tensor_quantized_tensor %158, %float3.906250e-03, %int0 : !torch.vtensor<[64,64,3,3],si8>, !torch.float, !torch.int -> !torch.vtensor<[64,64,3,3],!torch.qint8>
    %160 = torch.aten.quantize_per_tensor %6, %float3.125000e-02, %int0, %int12 : !torch.vtensor<[64],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[64],!torch.qint8>
    %161 = torch.aten.int_repr %160 : !torch.vtensor<[64],!torch.qint8> -> !torch.vtensor<[64],si8>
    %162 = torch.aten._make_per_tensor_quantized_tensor %161, %float3.125000e-02, %int0 : !torch.vtensor<[64],si8>, !torch.float, !torch.int -> !torch.vtensor<[64],!torch.qint8>
    %163 = torch.aten.dequantize.self %162 : !torch.vtensor<[64],!torch.qint8> -> !torch.vtensor<[64],f32>
    %164 = torch.aten.quantize_per_tensor %163, %float6.103520e-05, %int0, %int14 : !torch.vtensor<[64],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[64],!torch.qint32>
    %165 = torch.aten.int_repr %164 : !torch.vtensor<[64],!torch.qint32> -> !torch.vtensor<[64],si32>
    %166 = torch.aten.convolution %156, %159, %165, %120, %120, %120, %false, %122, %int1 : !torch.vtensor<[1,64,56,56],!torch.qint8>, !torch.vtensor<[64,64,3,3],!torch.qint8>, !torch.vtensor<[64],si32>, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.bool, !torch.list<int>, !torch.int -> !torch.vtensor<[1,64,56,56],si32>
    %167 = torch.aten._make_per_tensor_quantized_tensor %166, %float6.103520e-05, %int0 : !torch.vtensor<[1,64,56,56],si32>, !torch.float, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint32>
    %168 = torch.aten.relu %167 : !torch.vtensor<[1,64,56,56],!torch.qint32> -> !torch.vtensor<[1,64,56,56],!torch.qint32>
    %169 = torch.aten.int_repr %168 : !torch.vtensor<[1,64,56,56],!torch.qint32> -> !torch.vtensor<[1,64,56,56],si32>
    %170 = torch.aten._make_per_tensor_quantized_tensor %169, %float6.103520e-05, %int0 : !torch.vtensor<[1,64,56,56],si32>, !torch.float, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint32>
    %171 = torch.aten.dequantize.tensor %170 : !torch.vtensor<[1,64,56,56],!torch.qint32> -> !torch.vtensor<[1,64,56,56],f32>
    %172 = torch.aten.quantize_per_tensor %171, %float1.562500e-02, %int0, %int12 : !torch.vtensor<[1,64,56,56],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint8>
    %173 = torch.aten.int_repr %172 : !torch.vtensor<[1,64,56,56],!torch.qint8> -> !torch.vtensor<[1,64,56,56],si8>
    %174 = torch.aten._make_per_tensor_quantized_tensor %173, %float1.562500e-02, %int0 : !torch.vtensor<[1,64,56,56],si8>, !torch.float, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint8>
    %175 = torch.aten.quantize_per_tensor %7, %float3.906250e-03, %int0, %int12 : !torch.vtensor<[256,64,1,1],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[256,64,1,1],!torch.qint8>
    %176 = torch.aten.int_repr %175 : !torch.vtensor<[256,64,1,1],!torch.qint8> -> !torch.vtensor<[256,64,1,1],si8>
    %177 = torch.aten._make_per_tensor_quantized_tensor %176, %float3.906250e-03, %int0 : !torch.vtensor<[256,64,1,1],si8>, !torch.float, !torch.int -> !torch.vtensor<[256,64,1,1],!torch.qint8>
    %178 = torch.aten.quantize_per_tensor %8, %float7.812500e-03, %int0, %int12 : !torch.vtensor<[256],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[256],!torch.qint8>
    %179 = torch.aten.int_repr %178 : !torch.vtensor<[256],!torch.qint8> -> !torch.vtensor<[256],si8>
    %180 = torch.aten._make_per_tensor_quantized_tensor %179, %float7.812500e-03, %int0 : !torch.vtensor<[256],si8>, !torch.float, !torch.int -> !torch.vtensor<[256],!torch.qint8>
    %181 = torch.aten.dequantize.self %180 : !torch.vtensor<[256],!torch.qint8> -> !torch.vtensor<[256],f32>
    %182 = torch.aten.quantize_per_tensor %181, %float6.103520e-05, %int0, %int14 : !torch.vtensor<[256],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[256],!torch.qint32>
    %183 = torch.aten.int_repr %182 : !torch.vtensor<[256],!torch.qint32> -> !torch.vtensor<[256],si32>
    %184 = torch.aten.convolution %174, %177, %183, %120, %122, %120, %false, %122, %int1 : !torch.vtensor<[1,64,56,56],!torch.qint8>, !torch.vtensor<[256,64,1,1],!torch.qint8>, !torch.vtensor<[256],si32>, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.bool, !torch.list<int>, !torch.int -> !torch.vtensor<[1,256,56,56],si32>
    %185 = torch.aten._make_per_tensor_quantized_tensor %184, %float6.103520e-05, %int0 : !torch.vtensor<[1,256,56,56],si32>, !torch.float, !torch.int -> !torch.vtensor<[1,256,56,56],!torch.qint32>
    %186 = torch.aten.dequantize.tensor %185 : !torch.vtensor<[1,256,56,56],!torch.qint32> -> !torch.vtensor<[1,256,56,56],f32>
    %187 = torch.aten.quantize_per_tensor %186, %float7.812500e-03, %int0, %int12 : !torch.vtensor<[1,256,56,56],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[1,256,56,56],!torch.qint8>
    %188 = torch.aten.int_repr %187 : !torch.vtensor<[1,256,56,56],!torch.qint8> -> !torch.vtensor<[1,256,56,56],si8>
    %189 = torch.aten._make_per_tensor_quantized_tensor %188, %float7.812500e-03, %int0 : !torch.vtensor<[1,256,56,56],si8>, !torch.float, !torch.int -> !torch.vtensor<[1,256,56,56],!torch.qint8>
    %190 = torch.aten.dequantize.self %189 : !torch.vtensor<[1,256,56,56],!torch.qint8> -> !torch.vtensor<[1,256,56,56],f32>
    %191 = torch.aten.quantize_per_tensor %9, %float1.562500e-02, %int0, %int12 : !torch.vtensor<[256,64,1,1],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[256,64,1,1],!torch.qint8>
    %192 = torch.aten.int_repr %191 : !torch.vtensor<[256,64,1,1],!torch.qint8> -> !torch.vtensor<[256,64,1,1],si8>
    %193 = torch.aten._make_per_tensor_quantized_tensor %192, %float1.562500e-02, %int0 : !torch.vtensor<[256,64,1,1],si8>, !torch.float, !torch.int -> !torch.vtensor<[256,64,1,1],!torch.qint8>
    %194 = torch.aten.quantize_per_tensor %10, %float3.125000e-02, %int0, %int12 : !torch.vtensor<[256],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[256],!torch.qint8>
    %195 = torch.aten.int_repr %194 : !torch.vtensor<[256],!torch.qint8> -> !torch.vtensor<[256],si8>
    %196 = torch.aten._make_per_tensor_quantized_tensor %195, %float3.125000e-02, %int0 : !torch.vtensor<[256],si8>, !torch.float, !torch.int -> !torch.vtensor<[256],!torch.qint8>
    %197 = torch.aten.dequantize.self %196 : !torch.vtensor<[256],!torch.qint8> -> !torch.vtensor<[256],f32>
    %198 = torch.aten.quantize_per_tensor %197, %float4.882810e-04, %int0, %int14 : !torch.vtensor<[256],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[256],!torch.qint32>
    %199 = torch.aten.int_repr %198 : !torch.vtensor<[256],!torch.qint32> -> !torch.vtensor<[256],si32>
    %200 = torch.aten.convolution %138, %193, %199, %120, %122, %120, %false, %122, %int1 : !torch.vtensor<[1,64,56,56],!torch.qint8>, !torch.vtensor<[256,64,1,1],!torch.qint8>, !torch.vtensor<[256],si32>, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.bool, !torch.list<int>, !torch.int -> !torch.vtensor<[1,256,56,56],si32>
    %201 = torch.aten._make_per_tensor_quantized_tensor %200, %float4.882810e-04, %int0 : !torch.vtensor<[1,256,56,56],si32>, !torch.float, !torch.int -> !torch.vtensor<[1,256,56,56],!torch.qint32>
    %202 = torch.aten.dequantize.tensor %201 : !torch.vtensor<[1,256,56,56],!torch.qint32> -> !torch.vtensor<[1,256,56,56],f32>
    %203 = torch.aten.quantize_per_tensor %202, %float1.562500e-02, %int0, %int12 : !torch.vtensor<[1,256,56,56],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[1,256,56,56],!torch.qint8>
    %204 = torch.aten.int_repr %203 : !torch.vtensor<[1,256,56,56],!torch.qint8> -> !torch.vtensor<[1,256,56,56],si8>
    %205 = torch.aten._make_per_tensor_quantized_tensor %204, %float1.562500e-02, %int0 : !torch.vtensor<[1,256,56,56],si8>, !torch.float, !torch.int -> !torch.vtensor<[1,256,56,56],!torch.qint8>
    %206 = torch.aten.dequantize.self %205 : !torch.vtensor<[1,256,56,56],!torch.qint8> -> !torch.vtensor<[1,256,56,56],f32>
    %207 = torch.aten.add.Tensor %190, %206, %int1 : !torch.vtensor<[1,256,56,56],f32>, !torch.vtensor<[1,256,56,56],f32>, !torch.int -> !torch.vtensor<[1,256,56,56],f32>
    %208 = torch.aten.relu %207 : !torch.vtensor<[1,256,56,56],f32> -> !torch.vtensor<[1,256,56,56],f32>
    %209 = torch.aten.quantize_per_tensor %208, %float1.562500e-02, %int0, %int12 : !torch.vtensor<[1,256,56,56],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[1,256,56,56],!torch.qint8>
    %210 = torch.aten.int_repr %209 : !torch.vtensor<[1,256,56,56],!torch.qint8> -> !torch.vtensor<[1,256,56,56],si8>
    %211 = torch.aten._make_per_tensor_quantized_tensor %210, %float1.562500e-02, %int0 : !torch.vtensor<[1,256,56,56],si8>, !torch.float, !torch.int -> !torch.vtensor<[1,256,56,56],!torch.qint8>
    %212 = torch.aten.dequantize.self %211 : !torch.vtensor<[1,256,56,56],!torch.qint8> -> !torch.vtensor<[1,256,56,56],f32>
    %213 = torch.aten.quantize_per_tensor %11, %float3.906250e-03, %int0, %int12 : !torch.vtensor<[64,256,1,1],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[64,256,1,1],!torch.qint8>
    %214 = torch.aten.int_repr %213 : !torch.vtensor<[64,256,1,1],!torch.qint8> -> !torch.vtensor<[64,256,1,1],si8>
    %215 = torch.aten._make_per_tensor_quantized_tensor %214, %float3.906250e-03, %int0 : !torch.vtensor<[64,256,1,1],si8>, !torch.float, !torch.int -> !torch.vtensor<[64,256,1,1],!torch.qint8>
    %216 = torch.aten.quantize_per_tensor %12, %float7.812500e-03, %int0, %int12 : !torch.vtensor<[64],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[64],!torch.qint8>
    %217 = torch.aten.int_repr %216 : !torch.vtensor<[64],!torch.qint8> -> !torch.vtensor<[64],si8>
    %218 = torch.aten._make_per_tensor_quantized_tensor %217, %float7.812500e-03, %int0 : !torch.vtensor<[64],si8>, !torch.float, !torch.int -> !torch.vtensor<[64],!torch.qint8>
    %219 = torch.aten.dequantize.self %218 : !torch.vtensor<[64],!torch.qint8> -> !torch.vtensor<[64],f32>
    %220 = torch.aten.quantize_per_tensor %219, %float6.103520e-05, %int0, %int14 : !torch.vtensor<[64],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[64],!torch.qint32>
    %221 = torch.aten.int_repr %220 : !torch.vtensor<[64],!torch.qint32> -> !torch.vtensor<[64],si32>
    %222 = torch.aten.convolution %211, %215, %221, %120, %122, %120, %false, %122, %int1 : !torch.vtensor<[1,256,56,56],!torch.qint8>, !torch.vtensor<[64,256,1,1],!torch.qint8>, !torch.vtensor<[64],si32>, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.bool, !torch.list<int>, !torch.int -> !torch.vtensor<[1,64,56,56],si32>
    %223 = torch.aten._make_per_tensor_quantized_tensor %222, %float6.103520e-05, %int0 : !torch.vtensor<[1,64,56,56],si32>, !torch.float, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint32>
    %224 = torch.aten.relu %223 : !torch.vtensor<[1,64,56,56],!torch.qint32> -> !torch.vtensor<[1,64,56,56],!torch.qint32>
    %225 = torch.aten.int_repr %224 : !torch.vtensor<[1,64,56,56],!torch.qint32> -> !torch.vtensor<[1,64,56,56],si32>
    %226 = torch.aten._make_per_tensor_quantized_tensor %225, %float6.103520e-05, %int0 : !torch.vtensor<[1,64,56,56],si32>, !torch.float, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint32>
    %227 = torch.aten.dequantize.tensor %226 : !torch.vtensor<[1,64,56,56],!torch.qint32> -> !torch.vtensor<[1,64,56,56],f32>
    %228 = torch.aten.quantize_per_tensor %227, %float1.562500e-02, %int0, %int12 : !torch.vtensor<[1,64,56,56],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint8>
    %229 = torch.aten.int_repr %228 : !torch.vtensor<[1,64,56,56],!torch.qint8> -> !torch.vtensor<[1,64,56,56],si8>
    %230 = torch.aten._make_per_tensor_quantized_tensor %229, %float1.562500e-02, %int0 : !torch.vtensor<[1,64,56,56],si8>, !torch.float, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint8>
    %231 = torch.aten.quantize_per_tensor %13, %float3.906250e-03, %int0, %int12 : !torch.vtensor<[64,64,3,3],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[64,64,3,3],!torch.qint8>
    %232 = torch.aten.int_repr %231 : !torch.vtensor<[64,64,3,3],!torch.qint8> -> !torch.vtensor<[64,64,3,3],si8>
    %233 = torch.aten._make_per_tensor_quantized_tensor %232, %float3.906250e-03, %int0 : !torch.vtensor<[64,64,3,3],si8>, !torch.float, !torch.int -> !torch.vtensor<[64,64,3,3],!torch.qint8>
    %234 = torch.aten.quantize_per_tensor %14, %float7.812500e-03, %int0, %int12 : !torch.vtensor<[64],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[64],!torch.qint8>
    %235 = torch.aten.int_repr %234 : !torch.vtensor<[64],!torch.qint8> -> !torch.vtensor<[64],si8>
    %236 = torch.aten._make_per_tensor_quantized_tensor %235, %float7.812500e-03, %int0 : !torch.vtensor<[64],si8>, !torch.float, !torch.int -> !torch.vtensor<[64],!torch.qint8>
    %237 = torch.aten.dequantize.self %236 : !torch.vtensor<[64],!torch.qint8> -> !torch.vtensor<[64],f32>
    %238 = torch.aten.quantize_per_tensor %237, %float6.103520e-05, %int0, %int14 : !torch.vtensor<[64],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[64],!torch.qint32>
    %239 = torch.aten.int_repr %238 : !torch.vtensor<[64],!torch.qint32> -> !torch.vtensor<[64],si32>
    %240 = torch.aten.convolution %230, %233, %239, %120, %120, %120, %false, %122, %int1 : !torch.vtensor<[1,64,56,56],!torch.qint8>, !torch.vtensor<[64,64,3,3],!torch.qint8>, !torch.vtensor<[64],si32>, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.bool, !torch.list<int>, !torch.int -> !torch.vtensor<[1,64,56,56],si32>
    %241 = torch.aten._make_per_tensor_quantized_tensor %240, %float6.103520e-05, %int0 : !torch.vtensor<[1,64,56,56],si32>, !torch.float, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint32>
    %242 = torch.aten.relu %241 : !torch.vtensor<[1,64,56,56],!torch.qint32> -> !torch.vtensor<[1,64,56,56],!torch.qint32>
    %243 = torch.aten.int_repr %242 : !torch.vtensor<[1,64,56,56],!torch.qint32> -> !torch.vtensor<[1,64,56,56],si32>
    %244 = torch.aten._make_per_tensor_quantized_tensor %243, %float6.103520e-05, %int0 : !torch.vtensor<[1,64,56,56],si32>, !torch.float, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint32>
    %245 = torch.aten.dequantize.tensor %244 : !torch.vtensor<[1,64,56,56],!torch.qint32> -> !torch.vtensor<[1,64,56,56],f32>
    %246 = torch.aten.quantize_per_tensor %245, %float1.562500e-02, %int0, %int12 : !torch.vtensor<[1,64,56,56],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint8>
    %247 = torch.aten.int_repr %246 : !torch.vtensor<[1,64,56,56],!torch.qint8> -> !torch.vtensor<[1,64,56,56],si8>
    %248 = torch.aten._make_per_tensor_quantized_tensor %247, %float1.562500e-02, %int0 : !torch.vtensor<[1,64,56,56],si8>, !torch.float, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint8>
    %249 = torch.aten.quantize_per_tensor %15, %float3.906250e-03, %int0, %int12 : !torch.vtensor<[256,64,1,1],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[256,64,1,1],!torch.qint8>
    %250 = torch.aten.int_repr %249 : !torch.vtensor<[256,64,1,1],!torch.qint8> -> !torch.vtensor<[256,64,1,1],si8>
    %251 = torch.aten._make_per_tensor_quantized_tensor %250, %float3.906250e-03, %int0 : !torch.vtensor<[256,64,1,1],si8>, !torch.float, !torch.int -> !torch.vtensor<[256,64,1,1],!torch.qint8>
    %252 = torch.aten.quantize_per_tensor %16, %float7.812500e-03, %int0, %int12 : !torch.vtensor<[256],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[256],!torch.qint8>
    %253 = torch.aten.int_repr %252 : !torch.vtensor<[256],!torch.qint8> -> !torch.vtensor<[256],si8>
    %254 = torch.aten._make_per_tensor_quantized_tensor %253, %float7.812500e-03, %int0 : !torch.vtensor<[256],si8>, !torch.float, !torch.int -> !torch.vtensor<[256],!torch.qint8>
    %255 = torch.aten.dequantize.self %254 : !torch.vtensor<[256],!torch.qint8> -> !torch.vtensor<[256],f32>
    %256 = torch.aten.quantize_per_tensor %255, %float6.103520e-05, %int0, %int14 : !torch.vtensor<[256],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[256],!torch.qint32>
    %257 = torch.aten.int_repr %256 : !torch.vtensor<[256],!torch.qint32> -> !torch.vtensor<[256],si32>
    %258 = torch.aten.convolution %248, %251, %257, %120, %122, %120, %false, %122, %int1 : !torch.vtensor<[1,64,56,56],!torch.qint8>, !torch.vtensor<[256,64,1,1],!torch.qint8>, !torch.vtensor<[256],si32>, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.bool, !torch.list<int>, !torch.int -> !torch.vtensor<[1,256,56,56],si32>
    %259 = torch.aten._make_per_tensor_quantized_tensor %258, %float6.103520e-05, %int0 : !torch.vtensor<[1,256,56,56],si32>, !torch.float, !torch.int -> !torch.vtensor<[1,256,56,56],!torch.qint32>
    %260 = torch.aten.dequantize.tensor %259 : !torch.vtensor<[1,256,56,56],!torch.qint32> -> !torch.vtensor<[1,256,56,56],f32>
    %261 = torch.aten.quantize_per_tensor %260, %float7.812500e-03, %int0, %int12 : !torch.vtensor<[1,256,56,56],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[1,256,56,56],!torch.qint8>
    %262 = torch.aten.int_repr %261 : !torch.vtensor<[1,256,56,56],!torch.qint8> -> !torch.vtensor<[1,256,56,56],si8>
    %263 = torch.aten._make_per_tensor_quantized_tensor %262, %float7.812500e-03, %int0 : !torch.vtensor<[1,256,56,56],si8>, !torch.float, !torch.int -> !torch.vtensor<[1,256,56,56],!torch.qint8>
    %264 = torch.aten.dequantize.self %263 : !torch.vtensor<[1,256,56,56],!torch.qint8> -> !torch.vtensor<[1,256,56,56],f32>
    %265 = torch.aten.add.Tensor %264, %212, %int1 : !torch.vtensor<[1,256,56,56],f32>, !torch.vtensor<[1,256,56,56],f32>, !torch.int -> !torch.vtensor<[1,256,56,56],f32>
    %266 = torch.aten.relu %265 : !torch.vtensor<[1,256,56,56],f32> -> !torch.vtensor<[1,256,56,56],f32>
    %267 = torch.aten.quantize_per_tensor %266, %float1.562500e-02, %int0, %int12 : !torch.vtensor<[1,256,56,56],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[1,256,56,56],!torch.qint8>
    %268 = torch.aten.int_repr %267 : !torch.vtensor<[1,256,56,56],!torch.qint8> -> !torch.vtensor<[1,256,56,56],si8>
    %269 = torch.aten._make_per_tensor_quantized_tensor %268, %float1.562500e-02, %int0 : !torch.vtensor<[1,256,56,56],si8>, !torch.float, !torch.int -> !torch.vtensor<[1,256,56,56],!torch.qint8>
    %270 = torch.aten.dequantize.self %269 : !torch.vtensor<[1,256,56,56],!torch.qint8> -> !torch.vtensor<[1,256,56,56],f32>
    %271 = torch.aten.quantize_per_tensor %17, %float3.906250e-03, %int0, %int12 : !torch.vtensor<[64,256,1,1],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[64,256,1,1],!torch.qint8>
    %272 = torch.aten.int_repr %271 : !torch.vtensor<[64,256,1,1],!torch.qint8> -> !torch.vtensor<[64,256,1,1],si8>
    %273 = torch.aten._make_per_tensor_quantized_tensor %272, %float3.906250e-03, %int0 : !torch.vtensor<[64,256,1,1],si8>, !torch.float, !torch.int -> !torch.vtensor<[64,256,1,1],!torch.qint8>
    %274 = torch.aten.quantize_per_tensor %18, %float1.562500e-02, %int0, %int12 : !torch.vtensor<[64],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[64],!torch.qint8>
    %275 = torch.aten.int_repr %274 : !torch.vtensor<[64],!torch.qint8> -> !torch.vtensor<[64],si8>
    %276 = torch.aten._make_per_tensor_quantized_tensor %275, %float1.562500e-02, %int0 : !torch.vtensor<[64],si8>, !torch.float, !torch.int -> !torch.vtensor<[64],!torch.qint8>
    %277 = torch.aten.dequantize.self %276 : !torch.vtensor<[64],!torch.qint8> -> !torch.vtensor<[64],f32>
    %278 = torch.aten.quantize_per_tensor %277, %float6.103520e-05, %int0, %int14 : !torch.vtensor<[64],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[64],!torch.qint32>
    %279 = torch.aten.int_repr %278 : !torch.vtensor<[64],!torch.qint32> -> !torch.vtensor<[64],si32>
    %280 = torch.aten.convolution %269, %273, %279, %120, %122, %120, %false, %122, %int1 : !torch.vtensor<[1,256,56,56],!torch.qint8>, !torch.vtensor<[64,256,1,1],!torch.qint8>, !torch.vtensor<[64],si32>, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.bool, !torch.list<int>, !torch.int -> !torch.vtensor<[1,64,56,56],si32>
    %281 = torch.aten._make_per_tensor_quantized_tensor %280, %float6.103520e-05, %int0 : !torch.vtensor<[1,64,56,56],si32>, !torch.float, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint32>
    %282 = torch.aten.relu %281 : !torch.vtensor<[1,64,56,56],!torch.qint32> -> !torch.vtensor<[1,64,56,56],!torch.qint32>
    %283 = torch.aten.int_repr %282 : !torch.vtensor<[1,64,56,56],!torch.qint32> -> !torch.vtensor<[1,64,56,56],si32>
    %284 = torch.aten._make_per_tensor_quantized_tensor %283, %float6.103520e-05, %int0 : !torch.vtensor<[1,64,56,56],si32>, !torch.float, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint32>
    %285 = torch.aten.dequantize.tensor %284 : !torch.vtensor<[1,64,56,56],!torch.qint32> -> !torch.vtensor<[1,64,56,56],f32>
    %286 = torch.aten.quantize_per_tensor %285, %float7.812500e-03, %int0, %int12 : !torch.vtensor<[1,64,56,56],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint8>
    %287 = torch.aten.int_repr %286 : !torch.vtensor<[1,64,56,56],!torch.qint8> -> !torch.vtensor<[1,64,56,56],si8>
    %288 = torch.aten._make_per_tensor_quantized_tensor %287, %float7.812500e-03, %int0 : !torch.vtensor<[1,64,56,56],si8>, !torch.float, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint8>
    %289 = torch.aten.quantize_per_tensor %19, %float3.906250e-03, %int0, %int12 : !torch.vtensor<[64,64,3,3],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[64,64,3,3],!torch.qint8>
    %290 = torch.aten.int_repr %289 : !torch.vtensor<[64,64,3,3],!torch.qint8> -> !torch.vtensor<[64,64,3,3],si8>
    %291 = torch.aten._make_per_tensor_quantized_tensor %290, %float3.906250e-03, %int0 : !torch.vtensor<[64,64,3,3],si8>, !torch.float, !torch.int -> !torch.vtensor<[64,64,3,3],!torch.qint8>
    %292 = torch.aten.quantize_per_tensor %20, %float7.812500e-03, %int0, %int12 : !torch.vtensor<[64],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[64],!torch.qint8>
    %293 = torch.aten.int_repr %292 : !torch.vtensor<[64],!torch.qint8> -> !torch.vtensor<[64],si8>
    %294 = torch.aten._make_per_tensor_quantized_tensor %293, %float7.812500e-03, %int0 : !torch.vtensor<[64],si8>, !torch.float, !torch.int -> !torch.vtensor<[64],!torch.qint8>
    %295 = torch.aten.dequantize.self %294 : !torch.vtensor<[64],!torch.qint8> -> !torch.vtensor<[64],f32>
    %296 = torch.aten.quantize_per_tensor %295, %float3.051760e-05, %int0, %int14 : !torch.vtensor<[64],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[64],!torch.qint32>
    %297 = torch.aten.int_repr %296 : !torch.vtensor<[64],!torch.qint32> -> !torch.vtensor<[64],si32>
    %298 = torch.aten.convolution %288, %291, %297, %120, %120, %120, %false, %122, %int1 : !torch.vtensor<[1,64,56,56],!torch.qint8>, !torch.vtensor<[64,64,3,3],!torch.qint8>, !torch.vtensor<[64],si32>, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.bool, !torch.list<int>, !torch.int -> !torch.vtensor<[1,64,56,56],si32>
    %299 = torch.aten._make_per_tensor_quantized_tensor %298, %float3.051760e-05, %int0 : !torch.vtensor<[1,64,56,56],si32>, !torch.float, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint32>
    %300 = torch.aten.relu %299 : !torch.vtensor<[1,64,56,56],!torch.qint32> -> !torch.vtensor<[1,64,56,56],!torch.qint32>
    %301 = torch.aten.int_repr %300 : !torch.vtensor<[1,64,56,56],!torch.qint32> -> !torch.vtensor<[1,64,56,56],si32>
    %302 = torch.aten._make_per_tensor_quantized_tensor %301, %float3.051760e-05, %int0 : !torch.vtensor<[1,64,56,56],si32>, !torch.float, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint32>
    %303 = torch.aten.dequantize.tensor %302 : !torch.vtensor<[1,64,56,56],!torch.qint32> -> !torch.vtensor<[1,64,56,56],f32>
    %304 = torch.aten.quantize_per_tensor %303, %float1.562500e-02, %int0, %int12 : !torch.vtensor<[1,64,56,56],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint8>
    %305 = torch.aten.int_repr %304 : !torch.vtensor<[1,64,56,56],!torch.qint8> -> !torch.vtensor<[1,64,56,56],si8>
    %306 = torch.aten._make_per_tensor_quantized_tensor %305, %float1.562500e-02, %int0 : !torch.vtensor<[1,64,56,56],si8>, !torch.float, !torch.int -> !torch.vtensor<[1,64,56,56],!torch.qint8>
    %307 = torch.aten.quantize_per_tensor %21, %float3.906250e-03, %int0, %int12 : !torch.vtensor<[256,64,1,1],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[256,64,1,1],!torch.qint8>
    %308 = torch.aten.int_repr %307 : !torch.vtensor<[256,64,1,1],!torch.qint8> -> !torch.vtensor<[256,64,1,1],si8>
    %309 = torch.aten._make_per_tensor_quantized_tensor %308, %float3.906250e-03, %int0 : !torch.vtensor<[256,64,1,1],si8>, !torch.float, !torch.int -> !torch.vtensor<[256,64,1,1],!torch.qint8>
    %310 = torch.aten.quantize_per_tensor %22, %float7.812500e-03, %int0, %int12 : !torch.vtensor<[256],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[256],!torch.qint8>
    %311 = torch.aten.int_repr %310 : !torch.vtensor<[256],!torch.qint8> -> !torch.vtensor<[256],si8>
    %312 = torch.aten._make_per_tensor_quantized_tensor %311, %float7.812500e-03, %int0 : !torch.vtensor<[256],si8>, !torch.float, !torch.int -> !torch.vtensor<[256],!torch.qint8>
    %313 = torch.aten.dequantize.self %312 : !torch.vtensor<[256],!torch.qint8> -> !torch.vtensor<[256],f32>
    %314 = torch.aten.quantize_per_tensor %313, %float6.103520e-05, %int0, %int14 : !torch.vtensor<[256],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[256],!torch.qint32>
    %315 = torch.aten.int_repr %314 : !torch.vtensor<[256],!torch.qint32> -> !torch.vtensor<[256],si32>
    %316 = torch.aten.convolution %306, %309, %315, %120, %122, %120, %false, %122, %int1 : !torch.vtensor<[1,64,56,56],!torch.qint8>, !torch.vtensor<[256,64,1,1],!torch.qint8>, !torch.vtensor<[256],si32>, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.bool, !torch.list<int>, !torch.int -> !torch.vtensor<[1,256,56,56],si32>
    %317 = torch.aten._make_per_tensor_quantized_tensor %316, %float6.103520e-05, %int0 : !torch.vtensor<[1,256,56,56],si32>, !torch.float, !torch.int -> !torch.vtensor<[1,256,56,56],!torch.qint32>
    %318 = torch.aten.dequantize.tensor %317 : !torch.vtensor<[1,256,56,56],!torch.qint32> -> !torch.vtensor<[1,256,56,56],f32>
    %319 = torch.aten.quantize_per_tensor %318, %float7.812500e-03, %int0, %int12 : !torch.vtensor<[1,256,56,56],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[1,256,56,56],!torch.qint8>
    %320 = torch.aten.int_repr %319 : !torch.vtensor<[1,256,56,56],!torch.qint8> -> !torch.vtensor<[1,256,56,56],si8>
    %321 = torch.aten._make_per_tensor_quantized_tensor %320, %float7.812500e-03, %int0 : !torch.vtensor<[1,256,56,56],si8>, !torch.float, !torch.int -> !torch.vtensor<[1,256,56,56],!torch.qint8>
    %322 = torch.aten.dequantize.self %321 : !torch.vtensor<[1,256,56,56],!torch.qint8> -> !torch.vtensor<[1,256,56,56],f32>
    %323 = torch.aten.add.Tensor %322, %270, %int1 : !torch.vtensor<[1,256,56,56],f32>, !torch.vtensor<[1,256,56,56],f32>, !torch.int -> !torch.vtensor<[1,256,56,56],f32>
    %324 = torch.aten.relu %323 : !torch.vtensor<[1,256,56,56],f32> -> !torch.vtensor<[1,256,56,56],f32>
    %325 = torch.aten.quantize_per_tensor %324, %float1.562500e-02, %int0, %int12 : !torch.vtensor<[1,256,56,56],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[1,256,56,56],!torch.qint8>
    %326 = torch.aten.int_repr %325 : !torch.vtensor<[1,256,56,56],!torch.qint8> -> !torch.vtensor<[1,256,56,56],si8>
    %327 = torch.aten._make_per_tensor_quantized_tensor %326, %float1.562500e-02, %int0 : !torch.vtensor<[1,256,56,56],si8>, !torch.float, !torch.int -> !torch.vtensor<[1,256,56,56],!torch.qint8>
    %328 = torch.aten.quantize_per_tensor %23, %float3.906250e-03, %int0, %int12 : !torch.vtensor<[128,256,1,1],f32>, !torch.float, !torch.int, !torch.int -> !torch.vtensor<[128,256,1,1],!torch.qint8>
    %329 = torch.aten.int_repr %328 : !torch.vtensor<[128,256,1,1],!torch.qint8> -> !torch.vtensor<[128,256,1,1],si8>
